Repository: Theordius/GesturesInSwiftUI
Catalog: GesturesInSwiftUI/Supporting Files/Localizable.xcstrings
Source language: en
Languages: pl

source: Bounce back gesture
pl: Gest odbicia

source: Click Me! Drag Me! Zoom Me!
pl: Kliknij Mnie! Przciągnij Mnie Przybliż Mnie!

source: Click on the gear menu
pl: Kliknij w ikonkę menu

source: Combined
pl: Łączone

source: Combined Gestures
pl: Gesty Łączone

source: Combining gestures
pl: Łączenie gestów

source: Drag And Drop
pl: Przeciągnij i upuść

source: Drag and drop gesture
pl: Gest przeciągnij i upuść

source: Drag and Drop Gestures
pl: Gesty Przeciągnij i upuść

source: Drag and save the position of the item
pl: Przeciągnij i zachowaj pozycję

source: Drag example utilizing zIndex
pl: Przykład przeciągania z zIndexem

source: Drag gesture with bounce back
pl: Gest przeciągnięcia z odbiciem

source: Drag Gesture with bounce back
pl: Gest Przeciągania z odbiciem

source: Drag gesture with state saving
pl: Gest przeciągania z zachowaniem stanu

source: Drag gesture with tracked possition
pl: Gest przeciągania z śledzeniem pozycji

source: Drag Gestures
pl: Gesty przeciągania

source: Drag item and preserve it's position across the views
pl: Przeciągnij obiekt zachowując jego pozycję pomiędzy widokami

source: Drag me!
pl: Przeciągnij mnie

source: Drag Me!
pl: Przeciągnij Mnie!

source: Dragging with bounce back effect
pl: Przeciąganie z efektem odbicia

source: Dragging without bouncing
pl: Przeciąganie bez efektu odbicia

source: Draging with and keeping item in place
pl: Gest przeciągania z zachowaniem stanu pomiędzy widokami

source: Draging with bounce back effect
pl: Przeciaganie z efektem odbicia

source: English
pl: Angielski

source: Example 1
pl: Przykład 1

source: Example 1 View
pl: Przykład 1

source: Example 2
pl: Przykład 2

source: Example 3
pl: Przykład 3

source: Example 4
pl: Przykład 4

source: Example 5
pl: Przykład 5

source: General
pl: Ogólne

source: General Gesrures
pl: Ogólne Gesty

source: General gestures
pl: Ogólne gesty

source: Hello, World!
pl: Cześć, Świecie!

source: Information
pl: Informacje

source: Keep magnification value
pl: Zachowaj wartość powiększenia

source: Keep scale factor across the views
pl: Zachowaj skalę pomiędzy widokami

source: Keeping magnification value
pl: Zachowując przybliżenie

source: Keeping rotation value
pl: Zachowując obrócenie

source: Long press gesture with context menu
pl: Długie naciśnięcie z menu kontekstowym

source: Long press gesture, context menu
pl: Długie naciśnięcie, menu kontekstowe

source: Magnification
pl: Powiększenie

source: Magnification Gesture
pl: Gest przybliżania

source: Magnification Gestures
pl: Gesty Powiększenia

source: Magnification with bounce back effect
pl: Powiększenie z efektem powrotu

source: Magnification with scale preservation across the views
pl: Powiększenie z zachowaniem skali pomiędzy widokami

source: Magnify and bounce back
pl: Powiekszenie i powrót do poprzedniego stanu

source: Magnify and Keep magnification value
pl: Powiększenie i utrzymanie wartości

source: Magnify and Keep Zoom Level
pl: Powiększenie i podtrzmanie wartości

source: Magnify with bounce back
pl: Powiększenie z odbiciem

source: Magnify with keeping the value
pl: Powiększenie z zachowaniem wartości

source: Magnify with value storage
pl: Powiększenie z przechowywaniem wartoście

source: On this example you can drag the icon under this text or icon over another icon
pl: Na tym przykładzie możesz przesunąć ikonę pod tekst lub nad ikonkę.

source: Polish
pl: Polski

source: Preserve the rotation angle
pl: Zachowaj kąt obrócenia

source: Preview
pl: Podgląd

source: Randomize
pl: Tasowanie

source: Rotate back and return to starting value
pl: Powród do pierwotnego kąta

source: Rotate Me!
pl: Obróć Mnie!

source: Rotation
pl: Obracanie

source: Rotation Gesture
pl: Gest obracania

source: Rotation gestures
pl: Gesty obracania

source: Rotation Gestures
pl: Gesty obracania

source: Rotation with Bounce Back effect
pl: Obrócenie z efektem powrotu

source: Rotation Without Bounce Back
pl: Obrócenie bez efektu powrotu

source: Rotation Without State Preserving
pl: Obrócenie z zachowaniem wartości pomiędzy widokami

source: Rotation, Magnification, Draging
pl: Obracanie, Powiększanie, Przeciąganie

source: Storing Value
pl: Przechowywana wartość

source: Subtitle
pl: Podtytuł

source: Swift UI Gestures
pl: Gesty w SwiftUI

source: This application was built with SwiftUI without usage of 3rd party libraries mostly for educational purposes and to show various possibilities of using gestures with swift UI
pl: Ta aplikcja zostalła zbudowana przy użyciu SwiftUI bez używania osobnych bibliotek głównie na potrzeby szkoleniowe i żeby pokaząc różne możliwości wykorzystania SwiftUI

source: You can change the app language if needed
pl: Możesz zmienić język aplikacji jeśli chcesz

source: Zoom Me!
pl: Przybliż mnie!
